{
    "hi": "Hello! How can I help you?",
    "hello": "Hi there! What can I do for you?",
    "thank you": "You're welcome!",
    "bye": "Goodbye! Have a great day!",
    "order status": "Please provide your order number.",
    "where is my order": "Please provide your order number, and I'll check the status for you.",
    "help": "How can I assist you?",
    "recommend": "What kind of recommendations are you looking for?",
    "track order": "Please provide your order number to check the delivery status.",
    "product search": "What product are you looking for?",
    "order confirmation": "Please provide your order number to confirm the details.",
    "feedback": "I'd love to hear your feedback!",
    "tell me about": "What would you like to know more about?",
    "cart": "Would you like to view the items in your cart?",
    "shipping information": "Can you provide your address for shipping details?",
    "payment": "Can I assist you with any payment-related questions?",
    "coupons": "Do you have any coupon codes to apply?",
    "what's your name": "I'm your friendly chatbot named SEEKSPHERE. What's yours?",
    "search by image": "Please upload an image to search for products.",
    "find similar products": "I'll find similar products to the one you uploaded.",
    "search by voice": "Please speak the product you're looking for.",
    "track shipment": "Please provide the tracking number to track your shipment.",
    "cancel order": "Let me help you with canceling your order. Please provide the order number.",
    "return item": "I can assist with returning an item. Please provide the order number.",
    "modify order": "I can help you modify your order. Please provide the order number.",
    "upload image for search": "Please upload an image, and I'll find similar products for you.",
    "voice search": "Please speak the product you're looking for, and I'll help you find it.",
    "random conversation": "Let's chat! What would you like to talk about?",
    "how are you": "I'm just a bunch of code, but I'm here to help you!",
    "what's up": "Not much, just here to help you!",
    "tell me a joke": "Why donot scientists trust atoms? Because they make up everything!",
    "tell me a story": "Once upon a time, in a land far, far away...",
    "what's your favorite color": "I donot have a favorite color, but I think blue looks nice!",
    "how do you work": "I work by analyzing your inputs and giving you the best possible answers!",
    "what's your purpose": "My purpose is to assist you with all your e-commerce needs!",
    "can you sing": "I can't sing, but I can share some great music recommendations!",
    "good morning": "Good morning! How can I help you today?",
    "good night": "Good night! Sleep well!",
    "what's your favorite food": "I donot eat, but pizza seems like a popular choice!",
    "what's the time": "I donot know the exact time, but you can check your device for that!",
    "do you have a favorite movie": "I donot watch movies, but 'The Matrix' is a classic!",
    "are you human": "Nope, just a chatbot, but I can help you like one!",
    "what do you like to do": "I love helping people like you with their queries!",
    "can you dance": "I can't dance, but I can tell you about some cool dance moves!",
    "do you sleep": "I donot sleep, I am always here to help you!",
    "do you have friends": "I donot have friends, but I am here for you!",
    "can you solve a riddle": "Sure, here's one: What has keys but can't open locks?",
    "how old are you": "I donot have an age, but I was created to assist you!",
    "do you play games": "I donot play games, but I can suggest some fun ones!",
    "do you watch TV": "I donot watch TV, but I can help you find some great shows!",
    "can you help with homework": "I can certainly try! What subject are you working on?",
    "are you real": "I am real in the sense that I am here to assist you, but I am just code!",
    "can you predict the future": "I can't predict the future, but I can help you make informed decisions!",
    "what's the meaning of life": "I think it's about learning, growing, and helping others!",
    "do you have a favorite book": "I donot read books, but '1984' by George Orwell is a good one!"
}
